results/deno/k6_security_stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/security.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * default: 10 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 282 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 616 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 953 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 1295 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 1629 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 1969 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 2308 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 2647 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 2989 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 3330 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 3672 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 4012 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 4350 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 4687 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 5030 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 15123   1005.950376/s
    checks_succeeded...: 100.00% 15123 out of 15123
    checks_failed......: 0.00%   0 out of 15123

    ✓ net: got 200
    ✓ env: endpoint ok
    ✓ fs: responded

    HTTP
    http_req_duration..............: avg=9.86ms  min=113.9µs med=327.15µs max=148.1ms  p(90)=28.78ms p(95)=30.12ms
      { expected_response:true }...: avg=9.86ms  min=113.9µs med=327.15µs max=148.1ms  p(90)=28.78ms p(95)=30.12ms
    http_req_failed................: 0.00%  0 out of 15123
    http_reqs......................: 15123  1005.950376/s

    EXECUTION
    iteration_duration.............: avg=29.78ms min=25.48ms med=28.94ms  max=148.99ms p(90)=31.82ms p(95)=33.54ms
    iterations.....................: 5041   335.316792/s
    vus............................: 10     min=10         max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 3.5 MB 235 kB/s
    data_sent......................: 1.2 MB 78 kB/s



running (15.0s), 00/10 VUs, 5041 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  15s